Tekla Open API Reference for Tekla Structures 2025
EnvironmentVariables.GetEnvironmentVariable Method
 Gets an environment variable.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string GetEnvironmentVariable(
	string variableName
)
Public Shared Function GetEnvironmentVariable (
	variableName As String
) As String
Parameters
variableName
Type: System.String
The name of the variable to get.
Return Value
Type: String
The environment variable.
See Also
Reference
EnvironmentVariables Class
Tekla.Structures.Dialog.UIControls Namespace